Tekla.Structures.Dialog.UIControls.WpfSaveLoad
Interaction logic for WpfSaveload.xaml
WpfSaveLoad

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.selectedFileName
File extension.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.saveAsText
File extension.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad._fileExtension
File extension.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad._helpUrl
Help url.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad._helpKeyword
Help keyword.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.#ctor
Initializes a new instance of the Tekla.Structures.Dialog.UIControls.WpfSaveLoad class with the default language and file extensions.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.AttributesLoaded
The AttributesLoaded event is triggered just after attributes have been loaded into the dialog.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.AttributesSaved
The AttributesSaved event is triggered just after attributes are saved to a file.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.HelpOpened
The HelpOpened event is triggered just after the help file is opened.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.AttributesLoadClicked
The AttributesLoadClicked event is triggered just after the load button has been clicked.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.AttributesSaveClicked
The AttributesSaveClicked event is triggered just after the save button has been clicked.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.HelpOpenClicked
The HelpOpenClicked event is triggered just after the help button has been clicked.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.SaveAsText
Gets or sets the text in the SaveAs text box.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.SelectedFileName
Gets or sets the text in the SaveAs text box.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.SaveLoadText
Gets the currently selected file name in the Save/Load combo box.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.HelpUrl
Gets or sets the HelpUrl where the help file is located.
If you do not provide a HelpUrl, the Tekla Structures help viewer will be displayed with given HelpKeyword.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.HelpKeyword
Gets or sets the HelpKeyword that the help file should be opened for.
If you do not provide a HelpKeyword and HelpUrl is not set, the default
start page for Tekla Structures Help viewer is displayed.
If you would like to show for example the topic in the following location:
"C:\MyApp\Sample.chm::/SubBook.chm::/MainPage.htm", the HelpKeyword
would be "SubBook.chm::/MainPage.htm".
If you are using the HelpProvider class to provide pop-up or online help for controls,
you can get the keyword by calling HelpProvider1.GetHelpKeyword(this).
If you would like to use Tekla Structures Help Viewer, you can do so by specifying HelpKeyword as "Filename"
without extension and not setting the HelpUrl.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.HelpFileType
Gets or sets the help file type.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.UserDefinedHelpFilePath
Gets or sets the file path where the UserDefined help file is located.
If you do not provide a UserDefinedHelpFilePath, the general Help file, help.chm, will be displayed.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.AttributeFileDirectories
Gets or sets the attribute file directories.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.FileExtension
Gets or sets the file extension for the attribute files loaded and saved by the control.
The file extension.
Remarks: Note that any "." characters will be removed from the beginning and end of the file extension.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.OnLoaded(System.Object,System.Windows.RoutedEventArgs)
When the control is loaded, checks if the parent was loaded in order to update it.
sender: The sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.InitializeAttributeFileDirectories
Initializes the list of search directories to the standard Tekla search directories (model, XS_PROJECT, XS_FIRM, system)

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.ComboBoxFileListUpdate
Updates or re-populates the file list

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.save_Click(System.Object,System.Windows.RoutedEventArgs)
Saves the dialog properties to the currently selected file name and calls any AttributesSaved events for additional save related routines.
sender: Event sender
e: Event arguments

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.LoadStandardFileAndApplyValues(Tekla.Structures.Dialog.WindowBase,System.String)
Loads the dialog values from the file and performs apply on the loaded values.
form: Dialog form
fileName: File name

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.load_Click(System.Object,System.Windows.RoutedEventArgs)
Loads the dialog properties from the currently selected file name and calls any AttributesLoading and AttributesLoaded events for additional load related routines.
sender: Event sender
e: Event arguments

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.help_Click(System.Object,System.Windows.RoutedEventArgs)
Opens the help file.
When General help file type is selected, HelpUrl and HelpKeyword can be set as properties by the father application.
If UserDefined help file type is selected, UserDefinedHelpFilePath can be set as property by the father application.
sender: Event sender
e: Event arguments

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.OnParentLoaded(System.Object,System.EventArgs)
When control is loaded checks if the parent was loaded to update it.
sender: Event sender
e: Event arguments

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.InitializeFileList
Updates (populates) the file list and if a "standard" file exists, loads it.

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.SaveValuesToXml(System.String)
Saves control's values to an xml file.
fileName: File name

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.ComboBoxFileListTextChanged(System.Object,System.EventArgs)
If comboBoxFileList contains invalid characters loadButton is disabled.
sender: Event sender
e: Event arguments

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.comboBoxFileList_SelectionChanged(System.Object,System.Windows.Controls.SelectionChangedEventArgs)
If comboBoxFileList contains invalid characters loadButton is disabled.
sender: Event sender
e: Event arguments

Tekla.Structures.Dialog.UIControls.WpfSaveLoad.InitializeComponent
InitializeComponent